ciaa/firmware_v1/externals/drivers/msp430/inc/msp430f5171.h
#define TLV_LDTAG             (0x01)      /*  Legacy descriptor (1xx, 2xx, 4xx families) */
#define TLV_PDTAG             (0x02)      /*  Peripheral discovery descriptor */
#define TLV_Reserved3         (0x03)      /*  Future usage */
#define TLV_Reserved4         (0x04)      /*  Future usage */
#define TLV_BLANK             (0x05)      /*  Blank descriptor */
#define TLV_Reserved6         (0x06)      /*  Future usage */
#define TLV_Reserved7         (0x07)      /*  Serial Number */
#define TLV_DIERECORD         (0x08)      /*  Die Record  */
#define TLV_ADCCAL            (0x11)      /*  ADC12 calibration */
#define TLV_ADC12CAL          (0x11)      /*  ADC12 calibration */
#define TLV_REFCAL            (0x12)      /*  REF calibration */
#define TLV_ADC10CAL          (0x13)      /*  ADC10 calibration */
#define TLV_TIMERDCAL         (0x15)      /*  TIMER_D calibration */
#define TLV_TAGEXT            (0xFE)      /*  Tag extender */
#define TLV_TAGEND            (0xFF)      /*  Tag End of Table */

/************************************************************
* Interrupt Vectors (offset from 0xFF80)
************************************************************/


#define PORT2_VECTOR            (46)                     /* 0xFFDA Port 2 */
#define PORT1_VECTOR            (47)                     /* 0xFFDC Port 1 */
#define TIMER1_D1_VECTOR        (48)                     /* 0xFFDE Timer1_D3 CC1-2, TA1 */
#define TIMER1_D0_VECTOR        (49)                     /* 0xFFE0 Timer1_D3 CC0 */
#define TEC1_VECTOR             (50)                     /* 0xFFF2 Timer Event Controller 1 */
#define DMA_VECTOR              (51)                     /* 0xFFE4 DMA */
#define TIMER0_A1_VECTOR        (52)                     /* 0xFFE6 Timer0_A3 CC1-2, TA */
#define TIMER0_A0_VECTOR        (53)                     /* 0xFFE8 Timer0_A3 CC0 */
#define USCI_B0_VECTOR          (55)                     /* 0xFFEC USCI B0 Receive/Transmit */
#define USCI_A0_VECTOR          (56)                     /* 0xFFEE USCI A0 Receive/Transmit */
#define WDT_VECTOR              (57)                     /* 0xFFF0 Watchdog Timer */
#define TIMER0_D1_VECTOR        (58)                     /* 0xFFE2 Timer0_D3 CC1-2, TA */
#define TIMER0_D0_VECTOR        (59)                     /* 0xFFE4 Timer0_D3 CC0 */
#define TEC0_VECTOR             (60)                     /* 0xFFF6 Timer Event Controller 0 */
#define COMP_B_VECTOR           (61)                     /* 0xFFF8 Watchdog Timer */
#define UNMI_VECTOR             (62)                     /* 0xFFFA User Non-maskable */
#define SYSNMI_VECTOR           (63)                     /* 0xFFFC System Non-maskable */
#define RESET_VECTOR            ("reset")                /* 0xFFFE Reset [Highest Priority] */

/************************************************************
* End of Modules
************************************************************/
#ifdef __cplusplus
}
#endif /* extern "C" */

#endif /* #ifndef __MSP430F5171 */

